{"basics":{"name":"Nathaniel Morgan","label":"Computer Science and Engineering Student","image":"","email":"nmorgan@csail.mit.edu","phone":"864-324-8208","url":"https://n-morgan.github.io","summary":"Undergraduate student at MIT with expertise in computer science, DevOps, and NLP AI engineering. Focused on LLM research and innovative tech solutions.","location":{"address":"Cambridge, MA","postalCode":"","city":"Cambridge","countryCode":"US","region":"MA"},"profiles":[{"network":"GitHub","username":"n-morgan","url":"https://n-morgan.github.io"}]},"work":[{"name":"Subconscious.AI","position":"AI Research Engineer","url":"","startDate":"2025-05","endDate":"Present","summary":"Benchmarked SGThread system and worked to deploy novel inference engine and RL trained model to serverless platform.","highlights":["Benchmarked SGThread system and deployed a novel inference engine and RL-trained TIM model to a serverless platform","Containerized and modified fork of SGLang, implementing custom stop conditions and refining token handling and hidden state propagation for stable, high-quality reasoning","Created Python interface for Google DataCommons and AIME benchmarking of the modified inference engine and TIM model through constrained decoding pipelines","Edited and contributed to the associated research paper, ensuring accurate presentation of methods and results"],},{"name":"BitEnergyAI","position":"Backend/Kernel Developer","url":"","startDate":"2025-01","endDate":"2025-05","summary":"Developed code for FP8 E4M3 multiplication on FPGA in C++ with Vitis-AI HLS to integrate transformer architecture with efficient floating point arithmetic operations.","highlights":["Designed host interface for multiplication between NxD weight matrix and DxM input matrix.","Implemented FP8 multiplication and addition through fused multiply add in C++.","Optimized matrix multiplication kernel through Vitis High-Level Synthesis best design practices.","Conducted software and hardware emulation of FPGA design."]},{"name":"SALIERI.AI","position":"Full-stack/NLP AI Engineer Intern","url":"","startDate":"2024-05","endDate":"2024-08","summary":"Developed a server-less SaaS deployment with an autoscaling Kubernetes cluster hosted on GCP to facilitate structuring LLM output into parsable JSON based on business text document stores.","highlights":["Utilized Node.js to create a web-hook API, enabling communication with a Python \"child process\" via inter-process communication (IPC).","Developed 3 containerized micro-services for scalability and created network for intra-container communication.","Restricted LLM output using Context-Free Grammars in GBNF format and JSON to ensure valid generation (token generation constraint).","Built and optimized an autoscaling Kubernetes cluster with MySQL data store on Google Cloud Platform, with containers stored in Google Artifact Registry and configured using Helm Chart for long-term sustainability."]}],"volunteer":[{"organization":"Uplift.co 501(c)(3)","location":"","position":"Founder","url":"http://www.communityuplift.co","startDate":"2019-05","endDate":"2025-01","summary":"Organized first cohort and facilitated weekly meetings to grow the project to a peak of 30 members.","highlights":["Assisted in the creation of 5 in person wellness events and 10 digital wellness campaigns.","Built components of brand including website, Instagram, and initial digital wellness campaigns for public awareness of organization."]}],"education":[{"institution":"Massachusetts Institute of Technology (MIT)","location":"Cambridge, MA","url":"","area":"Major 6-3 Computer Science and Engineering","studyType":"Candidate for Bachelor of Science","startDate":"","endDate":"2027-05","score":"4.5","courses":["Deep Learning","Mathematics for Computer Science","Data Structures and Algorithms","Linear Algebra","Machine Learning","Probability & Statistics"]}],"awards":[{"title":"MIT Student Information and Processing Board (SIPB) (Keyholder)","date":"2023-12","awarder":"MIT","url":"","summary":""},{"title":"Harvard x MIT CO-OP (Student Board Member)","date":"2024-08","awarder":"Harvard University & MIT","url":"","summary":""},{"title":"International Science and Engineering Fair (Finalist)","date":"2021-10","awarder":"Society for Science","url":"","summary":""}],"publications":[{"name":"THREAD, \"Thinking Deeper with Recursive Spawning\"","publisher":"NAACL 2025","releaseDate":"2024-05","url":"https://arxiv.org/abs/2405.17402","summary":"Phillip Schroeder, Nathaniel W. Morgan, Hongyin Luo, James R. Glass."}],"skills":[{"name":"Computer Science","level":"","icon":"","keywords":["Python","Java Script","Bash","SQLite"]},{"name":"DevOps","level":"","icon":"","keywords":["Google Cloud Platform","Kubernetes","Docker","Kubectl","Minikube","Tmux","Vim"]},{"name":"Software","level":"","icon":"","keywords":["Google G-suite","Microsoft 365 Office","Adobe Creative Cloud"]},{"name":"Languages","level":"","icon":"","keywords":["English","Spanish"]}],"languages":[{"language":"English","fluency":"","icon":""},{"language":"Spanish","fluency":"","icon":""}],"interests":[],"research":[{"name":"Dynamic Data Storage and Retrieval [LOGIC]","organization":"CSAIL, Cambridge, MIT","position":"Undergraduate Researcher","startDate":"2025-01","endDate":"Present","summary":"Leading research within the CSAIL Spoken Language Systems Group (SLS) at MIT, focusing on enhancing retriever performance in resource-augmented generation (RAG) systems through model editing.","highlights":["Benchmarked BERT-Large-Cased performance by generating a synthetic query-document set and extracting [CLS] token embeddings from a pretrained model using PyTorch.","Created vector database with FAISS Index and SQLite for efficient document storage and retrieval based on document embeddings.","Adapted MALMEN (ICLR 2025) to fit multi-class classification objective."]},{"name":"Dynamic Data Storage and Retrieval [DDSR]","organization":"CSAIL, Cambridge, MIT","position":"Undergraduate Researcher","startDate":"2024-09","endDate":"2024-12","summary":"Lead research within the CSAIL Spoken Language Systems Group (SLS) at MIT into the utilization of Modern Continuous Hopfield Networks to model Memory for LLMs.","highlights":["Constructed tensor-based data processing pipeline utilizing Kaggle sentence dataset and tokenization via Mistral tokenizer.","Trained network with PyTorch and evaluated results with matplotlib."]},{"name":"Thinking Deeper with Recursive Spawning [THREAD] Benchmark Creation","organization":"CSAIL, Cambridge, MIT","position":"Undergraduate Researcher","startDate":"2024-01","endDate":"2024-05","summary":"Conducted research within the CSAIL Spoken Language Systems Group (SLS) at MIT for the creation of a benchmark for LLM natural language embedded program generation.","highlights":["Produced >50 ground truth Python programs for synthetic data generation to create evaluation dataset.","Created API calls for aggregate data collection and processing from Google Data Commons."]}],"projects":[{"name":"ARK (Automated Resource Knowledge Base)","summary":"Leading a team of 6 across MIT, GT and UIC to create a community LLM app store and modular personalized agentic assistant development platform.","highlights":["Configured LLM Inference with Hugging-Face TGI and Qwen-2.5 weights hosted on HuggingFace Hub.","Created 'base_module interface for agentic tool calling and inference engine abstraction layer.","Organized project outline including \"GitHub Org.\", task list, weekly meetings, and various repositories for maintaining current and future contribution consistency as project scales.","Secured $5000 grant from MIT SIPB for development server build.","Built and set up headless dev server including installing CUDA kernel, configuring Linux distro, adding user SSH keys, and configuring user permissions."],"startDate":"2023-04",